---
type: FormulaEditingEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 4
tags: [revit-api, class]
---

# FormulaEditingEventArgs

`Autodesk.Revit.UI.Events.FormulaEditingEventArgs` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Apply | — | `public void Apply ( string formula )` |
| Property | CurrentDocument | — | `public Document CurrentDocument { get ; }` |
| Property | Formula | — | `public string Formula { get ; }` |
| Property | ParameterId | — | `public ElementId ParameterId { get ; }` |